[
  {
    "title": "Today",
    "paragraphs": [
      "I have been a software developer for over four years, working on a project that I have seen go from ~20k LOC of code to over 500k LOC with a team that ranged from four to 16 developers. During that time I moved through the ranks from Full-stack Developer to Lead Software Engineer managing a team of up to 5 developers and participating in processes that shaped the future of the application.",
      "The primary tools I utilized were Vue JS, Typescript, Ruby on Rails, and MongoDB.",
      "For information on how I landed in software development, see below."
    ]
  },
  {
    "title": "Physics",
    "paragraphs": [
      "My background is in physics. After 10 years of higher education, I received my doctorate in Physics from UMBC. I enjoyed the first years of graduate work; learning and solving physics problems was miserable yet rewarding, tiring but worthwhile. It was the difficulty that made the work appealing and the teamwork with my cohort that made it better. I loved physics, or so I thought.",
      "After 2½ years of classes, I received my M.S. in physics and began my PhD research. After three more years of research, I realized that the life of a research scientist wasn’t for me. It was too theoretical and my time seemed to be filled with more politics than physics. While working diligently to complete my doctorate, I began to drift away from physics."
    ]
  },
  {
    "title": "Realization",
    "paragraphs": [
      "I had only a handful of opportunities to experience programming as a graduate student. I taught myself LabVIEW to interface with scientific equipment, VPython to create physics modeling assignments for students, and Mathematica to build theoretical physics simulations. It was through these experiences that I discovered my passion for programming. To aid my research, I built a program that, through automation, turned a process that once required 48 hours of attention to one that required only 10 minutes to set up. I came to realize that it was experiences like this, that allowed me to solve complex puzzles creatively, that I enjoyed that most."
    ]
  },
  {
    "title": "Web development",
    "paragraphs": [
      "By the time I graduated I knew I wanted to become a programmer. Dropping everything I had worked towards for the past 10 years was not a decision I made lightly, but I knew my passion and happiness  would be found not as a physicist, but as a programmer. I decided to learn web development. I needed to learn the skills of the trade but I also needed to pay rent so I worked as the Director of Tutoring at a small tutoring company for one year.",
      "Meanwhile, I considered ways to achieve my new goals and chose to enroll in <a href='https://launchschool.com/' class='inline-anchor' target='_blank'>Launch School</a>. For six months, I studied there in my spare time. It quickly became apparent that this was indeed my passion, so I quit my job to study at Launch School full-time. Now, almost one year into the program, I look back and can honestly say that programming is where I belong."
      ]
  },
  {
    "title": "What's next?",
    "paragraphs": [
      "Explore this site and see what I have done. If you would like to contact me, please <a href='#' class='inline-anchor' data-title='contact'>send me a message</a>."
    ]
  }
]
